/**
* Основная документация - https://developer.mozilla.org/ru/docs/Learn/JavaScript
*/

/**
 * Изучите поведение оператора "+": как он работает с числами, как - со строками.
 * Напишите код, который наглядно проиллюстрирует ваше исследование.
 */

/* Сложение чисел */

/* Сложение (конкатенация) строк*/

/* Приведение к строке, если хотя бы один из операндов является строкой */

/* Приведение к числу */

/* Сортировки */

/**
 * Чтобы создать обьект, в JS можно использовать синктаксис с фигурными скобками (пересмотрите документацию https://developer.mozilla.org/ru/docs/Learn/JavaScript).
 * А как к существовующему обьекту добавить новое свойство? Догадайтесь, покажите в коде.
 * А что произойдет, если обратиться к незаданному свойству обьекта? Опять же - проилюстрируйте кодом.
 * Найдите способ (прочитав документацию) удалить свойство из обьекта. И тоже пользуйте его в вашем коде.
 */

 /**
 * Проведите исследование, которые ответит на вопрос - что будет, если есть глобальная переменная с именем, допустим x,
 * и в функции обьявлена переменная с таким же именем.
 * Что если функция попытается изменить эту переменную - к которой из них будет обращение? Пишем и показываем код.
 */

/**
 * Напишите функцию, которая по размерам комнаты (ширина, высота, длина) возвращает площадь комнаты.
 * Затем  примените ее в программе, которая по размерам комнаты вычисляет - сколько нужно взять рулонов обоев,
 * чтобы оклеить эту комнату.
 * Размеры рулона - нужно задать.
*/

/**
* Напишите функцию, которая вычисляет факториал натурального числа ()
* console.time(), console.timeEnd()
* В первом варианте этой функции пользоваться рекурсией запрещено - функция не должна вызывать сама себя!
*/

/**
 * На основе того простого факта, что n != n * (n -1)! упростить код,
 * сделав функцию рекурсивной
 *
*/
